src/DataProcessors/РаботаСоСправочниками/РаботаСоСправочниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСоСправочниками</name>
</mdclass:DataProcessor>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/РаботаСоСправочниками/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьЭлементНаСервере()
	
	//сначала пытаемся найти элемент
	СсылкаНаТовар = Справочники.Номенклатура.НайтиПоНаименованию("Тестовый товар");
	Если НЕ СсылкаНаТовар.Пустая() Тогда
		Сообщить("такой элемент уже есть");
		Возврат;
	КонецЕсли; 
	
	НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйТовар.Наименование = "Тестовый товар";
	НовыйТовар.Артикул = "А-101";
	НовыйТовар.НаименованиеПолное = "Тестовый товар";
	НовыйТовар.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлемент(Команда)
	СоздатьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНаСервере()
	
	НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НоваяГруппа.Наименование = "Тостеры";
	НоваяГруппа.ВыгружатьНаСайт = Истина;
	НоваяГруппа.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	СоздатьГруппуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементВГруппеНаСервере()
	
	НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НоваяГруппа.Наименование = "Тостеры";
	НоваяГруппа.Записать();
	
	НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйТовар.Наименование = "Тостер Philips HD2581/00";
	НовыйТовар.Артикул = "фыаыфаф";
	НовыйТовар.НаименованиеПолное = "Тостер Philips HD2581/00";
	НовыйТовар.Родитель = НоваяГруппа.Ссылка;
	НовыйТовар.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементВГруппе(Команда)
	СоздатьЭлементВГруппеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискЭлементаНаСервере()
	
	//1. Поиск во всем справочнике
	//поиск по наименованию
	НайденнаяСсылка = Справочники.Номенклатура.НайтиПоНаименованию("Холодильник ATLANT ХМ 4208-000", Истина);
	Если НайденнаяСсылка.Пустая() Тогда
		Сообщить("Товар не найден");
	Иначе
		Сообщить("Найден товар по наименованию: " + НайденнаяСсылка);	
	КонецЕсли; 
	
	//поиск по коду
	НайденнаяСсылка = Справочники.Номенклатура.НайтиПоКоду("000000011");
	Если НайденнаяСсылка.Пустая() Тогда
		Сообщить("Товар не найден");
	Иначе
		Сообщить("Найден товар по коду: " + НайденнаяСсылка);	
	КонецЕсли; 
	
	//поиск по реквизиту
	НайденнаяСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "ХМ 4208-00");
	Если НайденнаяСсылка.Пустая() Тогда
		Сообщить("Товар не найден");
	Иначе
		Сообщить("Найден товар по артикулу: " + НайденнаяСсылка);	
	КонецЕсли; 

	//2. Поиск внутри группы "Смартфон POCO X3"
	ГруппаСмартфоны = Справочники.Номенклатура.НайтиПоНаименованию("Смартфоны", Истина);
	НайденнаяСсылка = Справочники.Номенклатура.НайтиПоНаименованию("Смартфон POCO X3", Истина, ГруппаСмартфоны);
	Если НайденнаяСсылка.Пустая() Тогда
		Сообщить("Товар не найден");
	Иначе
		Сообщить("Найден товар в группе Смартфоны: " + НайденнаяСсылка);	
	КонецЕсли; 
	
	//3. Поиск в подчиненном справочнике
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("000000001");
	НайденныйДоговор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер", "1",,Контрагент);
	Если НайденныйДоговор.Пустая() Тогда
		Сообщить("Договор с номером 1 не найден");
	Иначе
		Сообщить("Найден договор: " + НайденныйДоговор + "(" + НайденныйДоговор.Владелец + ")");
	КонецЕсли;                                                  
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискЭлемента(Команда)
	ПоискЭлементаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЭлементНаСервере()
	
	//1. найти элемент, который нужно изменить
	СсылкаНаТовар = Справочники.Номенклатура.НайтиПоНаименованию("Холодильник ATLANT ХМ 4209-000", Истина);
	
	//2. изменить элемент и сохранить эти изменения (записать)
	Если НЕ СсылкаНаТовар.Пустая() Тогда
		ТоварОбъект = СсылкаНаТовар.ПолучитьОбъект();
		ТоварОбъект.Артикул = СтрЗаменить(ТоварОбъект.Артикул, "8", "9");
		ТоварОбъект.Записать();
		Сообщить("Артикул изменен");
	Иначе
		Сообщить("Товар не найден");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлемент(Команда)
	ИзменитьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементНаСервере()
	
	//ПОМЕТКА НА УДАЛЕНИЕ
	//1. найти элемент, который нужно удалить
	СсылкаНаТовар = Справочники.Номенклатура.НайтиПоНаименованию("Тестовый товар", Истина);
	//2. пометить элемент на удаление
	Если НЕ СсылкаНаТовар.Пустая() Тогда
		ТоварОбъект = СсылкаНаТовар.ПолучитьОбъект();
		ТоварОбъект.УстановитьПометкуУдаления(Истина);
		Сообщить("Товар помечен на удаление");
	Иначе
		Сообщить("Товар не найден");
	КонецЕсли; 
	
	//УДАЛИТЬ НЕПОСРЕДСТВЕННО
	//1. найти элемент, который нужно удалить
	СсылкаНаТовар = Справочники.Номенклатура.НайтиПоНаименованию("Тестовый товар", Истина);
	//2. пометить элемент на удаление
	Если НЕ СсылкаНаТовар.Пустая() Тогда
		ТоварОбъект = СсылкаНаТовар.ПолучитьОбъект();
		ТоварОбъект.Удалить();
		Сообщить("Товар помечен на удаление");
	Иначе
		Сообщить("Товар не найден");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлемент(Команда)
	УдалитьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьЭлементыНаСервере()
	
	//1. Выбрать все элементы справочника
	Выборка = Справочники.Номенклатура.Выбрать();
	
	//Сообщить("Все товары:");
	//Пока Выборка.Следующий() Цикл
	//	Сообщить(Выборка.Наименование);		
	//КонецЦикла; 
	
	//2. Выбрать все элементы из группы "Смартфоны"
	ГруппаСмартфоны = Справочники.Номенклатура.НайтиПоНаименованию("Смартфоны");
	//ВыборкаСмартфоны = Справочники.Номенклатура.Выбрать(ГруппаСмартфоны);
	//Пока ВыборкаСмартфоны.Следующий() Цикл
	//	Сообщить(ВыборкаСмартфоны.Наименование + " " + ВыборкаСмартфоны.Артикул);
	//КонецЦикла; 
	
	//3. Выбрать все элементы с видом номенклатуры "Холодильники"
	СсылкаНаВид = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Холодильники");
	СтруктураПоиска = Новый Структура("ВидНоменклатуры", СсылкаНаВид);
	ВыборкаХолодильники = Справочники.Номенклатура.Выбрать(,,СтруктураПоиска);
	//Сообщить("Все холодильники:");
	//Пока ВыборкаХолодильники.Следующий() Цикл
	//	Сообщить(ВыборкаХолодильники.Наименование);		
	//КонецЦикла; 
	
	//4. Выборка иерархическая
	ВыборкаПоИерархии = Справочники.Номенклатура.ВыбратьИерархически();
	Сообщить("Выборка по иерархии:");
	Пока ВыборкаПоИерархии.Следующий() Цикл
		Если ВыборкаПоИерархии.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли; 
		Сообщить(ВыборкаПоИерархии.Наименование + ВыборкаПоИерархии.Артикул);
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементы(Команда)
	ВыбратьЭлементыНаСервере();
КонецПроцедуры
